<x-page title="Components">

<x-p>
    Для создания интерфейса админ-панели <strong>MoonShine</strong> используется множество <em>UI компонентов</em>.<br />
    Вы можете воспользоваться этими компонентами для построения своих шаблонов,
    кастомных полей, фильтров, декораций или страниц.<br />
    Использование компонентов ускоряет разработку и позволяет сохранить единую стилистику проекта.
</x-p>

<x-p>
    Если вы планируете использовать компоненты за пределами админ-панели,
    то необходимо ваш шаблон добавить директиву с ассетами MoonShine.
</x-p>

<x-code language="blade">
    @@moonShineAssets
</x-code>

</x-page>
