<x-page title="Концепция" :sectionMenu="null">
    <x-p>
    Идея проекта Moonshine - создание альтернативы Laravel Nova. Во многих проектах наличие админ.панели обязательно и на её создание уходит много времени. Laravel Nova стоит 99$ и тратить эти деньги для каждого проекта немного накладно. И у меня появилась идея сделать свою админ.панель, но это огромная работа, и за несколько лет мне удалось создать рабочий вариант для выполнения самых распространенных задач. Но существует ряд серьёзных недостатков.
    </x-p>

    <x-p>
    Недавно в моём комьюнити CutCode посвященным Laravel поступило предложение создать свой open source проект, и я понял, что это именно тот подход который поможет реализовать хорошую админ.панель вместе, объединив усилия над общим делом.
    </x-p>

    <x-p>
    От взаимодействия в выигрыше будут все - Вы будете использовать качественный продукт, который всегда будет развиваться.
    </x-p>

    <x-p>
    Активное и живое сообщество является сердцем проекта. Поэтому самые активные пользователи будут поощряться. Как поощряться?
    Предварительная идея по форме поощрения - создание системы донатов. Пожертвованные деньги распределяются между основными участниками разработки. В настоящее время вопрос вынесен на обсуждение и решается в комьюнити.
    </x-p>

    <x-p>
    Моя задача - сделать проект местом, куда разработчики захотят возвращаться. Только вместе мы сможем сделать функциональную и удобную машину! Вместе мы сделаем больше, чем по одному!
    </x-p>
</x-page>
