<x-page title="Концепция" :sectionMenu="null">
    <x-p>
        Идея проекта Moonshine - создание многофункциональной и кастомизируемой админ-панели для проектов на Laravel.
        Почти во всех серьезных проектах наличие админ-панели обязательно и на её создание уходит много времени.
        И у меня появилась идея сделать свою админ-панель, но это огромная работа,
        и за несколько лет мне удалось создать рабочий вариант для выполнения самых распространенных задач.
    </x-p>

    <x-p>
        Недавно в моём комьюнити CutCode, посвященном Laravel, поступило предложение создать свой open source проект,
        и я понял, что это именно тот подход, который поможет реализовать хорошую админ-панель вместе,
        объединив усилия над общим делом.
    </x-p>

    <x-p>
        От взаимодействия в выигрыше будут все - Вы будете использовать качественный продукт, который всегда будет развиваться. Win-Win!
    </x-p>
	 <x-p>
        MoonShine это не просто админ-панель для использования! Это отдушина для разработчиков. Принимая участие в разработке вы можете эксперементировать в свое удовольствие! На работе однообразние, не получается проявить себя, устали от стека? Присоединяйтесь к разработке MoonShine! Реализуйте свои идеи, прокачайтесь как профессионал, попробуйте новый стек и общайтесь с профессионалами!
    </x-p>
    <x-p>
        Активное и живое сообщество является сердцем проекта. Поэтому самые активные пользователи будут поощряться.
        Предварительная идея по форме поощрения - создание системы донатов.
        Пожертвованные деньги распределяются между основными участниками разработки.
        Проект MoonShine участвует в программе поддержки от JetBrains "Free License Programs" -
        активные разработчики получают лицензию на продукты от JetBrains.
    </x-p>

    <x-p>
        Моя задача - сделать проект местом, куда разработчики захотят возвращаться.
        Только вместе мы сможем сделать функциональную и удобную машину! Вместе мы сделаем больше, чем по одному!
    </x-p>
</x-page>
