<x-page title="Contribution Guide" :sectionMenu="null">

<x-sub-title>Чем можно помогать?</x-sub-title>

<x-p>
    Сообществу нужны активные пользователи. Можно помочь разными формами
</x-p>

<x-ul :items="[
'Дополнять код',
'Front-end разработка',
'Отправлять отчёты об ошибках',
'Помогать другим пользователям разобраться в деталях',
'Заниматься написанием документации',
'Заниматься пропагандой'
]"></x-ul>

<x-sub-title>С чего мы начнем?</x-sub-title>

<x-p>
Есть уже функционирующий продукт, полностью работоспособный и поддающийся тестированию. Работающий не означает великолепный поэтому задача сделать проект именно таким.
</x-p>

<x-sub-title>Pull requests</x-sub-title>

<x-p>
    Вы можете предложить новые функции или улучшения для MoonShine! Ошибки и баги - все это можно зафиксировать и отправить на доработку.
    Также я рад новым специалистам по развитию open source проекта
</x-p>

<x-sub-title>Где обсуждать разработку?</x-sub-title>

<x-p>
    Для активных участников проекта создан отдельный чат в telegram, если Вы готовы принять участие в разработке, то вступайте - <x-link link="https://t.me/laravel_chat/24568">MoonShine</x-link>.
</x-p>


<x-sub-title>Если нашли ошибку</x-sub-title>

<x-p>
    1. У вас достаточно опыта чтобы предложить её решение.
    Я буду крайне рад вашему PR с описанием ошибки и вариантом её исправления.
    <br>
    2. Если не знаете как решить проблему - создавайте github issues и в ближайшее время мы исправим эту проблему.

    <div class="text-sm my-4">* Важно чтобы ваш pr прошел все тесты платформы и имел подробное описание, чтобы всем участникам разработки было понятно что именно произошло.</div>
</x-p>

<x-sub-title>Основная ветка</x-sub-title>

<x-p>
    На данный момент основная ветка <code>1.5.x</code>
</x-p>

<x-sub-title>Coding style</x-sub-title>

<x-p>
    MoonShine придерживается PSR-12 стандарта и PSR-4 autoload стандарта.
</x-p>

<x-sub-title>Возникли вопросы?</x-sub-title>

<x-p>
    Меня зовут, Данил! Пишите мне на почту <x-link link="mailto:info@cutcode.ru">info@cutcode.ru</x-link>
</x-p>

</x-page>
